In [10]:
import pandas 

#s= pandas.Series([1,2,3,4],["h1","h2","h3","h4"])

#s.iloc[2]
#s.loc["h3"]

pandas.Series([1,2,3,4],["h1","h2","h3","h4"]).iloc[:2]

h1    1
h2    2
dtype: int64

In [18]:
import pandas
pandas.Series([1,2,3,4],["h1","h2","h3","h4"]).loc["h2":"h4"]

# .drop["h3"]
# del df["h3"]

h2    2
h3    3
h4    4
dtype: int64

In [20]:
import pandas as pd

arr =[
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

idx = ['h1','h2','h3']
col = ['c1','c2','c3']
df = pd.DataFrame(arr,idx,col)
df

    c1  c2  c3
h1   1   2   3
h2   4   5   6
h3   7   8   9

In [22]:
df2 = pd.DataFrame(arr[1:], idx[1:], col)

df2

    c1  c2  c3
h2   4   5   6
h3   7   8   9

In [23]:
df+df2

      c1    c2    c3
h1   NaN   NaN   NaN
h2   8.0  10.0  12.0
h3  14.0  16.0  18.0

In [ ]:
s = pd.Series(arr[:1],idx[:1])
s

h1    [1, 2, 3]
dtype: object

In [27]:
df+s

    c1  c2  c3  h1
h1 NaN NaN NaN NaN
h2 NaN NaN NaN NaN
h3 NaN NaN NaN NaN

In [28]:
df.loc["h1","c1"]+s.loc["h1"]

np.int64(2)

In [ ]:
df3 = pd.DataFrame(arr[:1], idx[:1], col)
df3

    c1  c2  c3
h1   1   2   3

In [38]:
import numpy

idx = ['h1','h2','h3']
col = ['c1','c2','c3']
print(arr)
n_arr = numpy.delete(arr,-2,axis=1)
n_arr

col.pop(1)
df4= pd.DataFrame(n_arr,idx,col)
df4

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

    c1  c3
h1   1   3
h2   4   6
h3   7   9

In [40]:
df + df4

    c1  c2  c3
h1   2 NaN   6
h2   8 NaN  12
h3  14 NaN  18

In [ ]:
import pandas as pd
import numpy as np
a = np.random.randint(0,10,24).reshape(4,6)

li=["가","나","다","라"]
l2 = ["a","b","c","d","e","f"]
df= pd.DataFrame(a,li,l2)

df

   a  b  c  d  e  f
가  0  4  6  6  3  8
나  3  0  5  6  9  3
다  6  2  5  3  0  5
라  0  9  3  4  1  4

In [47]:
b= df[["a","b","c"]]

df +b

    a   b   c   d   e   f
가   0   8  12 NaN NaN NaN
나   6   0  10 NaN NaN NaN
다  12   4  10 NaN NaN NaN
라   0  18   6 NaN NaN NaN

In [57]:
df.loc["나":"다","b":"c"]

df[["b","c"]][1:3] #후자 슬라이싱...
df[["b","c"]]["나":"다"] #후자 슬라이싱...

   b  c
나  0  5
다  2  5

In [59]:
import pandas as pd
a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 72, 67, 15]
a4 = [75, 65, 95, 51, 18]
cols = ["국어", "영어", "수학", "과학", "나이"]
idx = ["a","b","c","d"]
df = pd.DataFrame([a1, a2, a3, a4], index=idx, columns=cols)
df

   국어  영어  수학  과학  나이
a  60  84  80  70  19
b  77  62  95  85  17
c  61  97  72  67  15
d  75  65  95  51  18

In [ ]:
df.sort_values(["영어"],ascending=False)

   국어  영어  수학  과학  나이
c  61  97  72  67  15
a  60  84  80  70  19
d  75  65  95  51  18
b  77  62  95  85  17

In [65]:
df.sort_values(["영어","수학"],ascending=[1,0])

   국어  영어  수학  과학  나이
b  77  62  95  85  17
d  75  65  95  51  18
a  60  84  80  70  19
c  61  97  72  67  15

In [76]:
#q1 위의 성적표에서 수학점수가 동률인 것만 출력하시오.
b = df["수학"].sort_values(ascending=False)
cnt = b.value_counts()
b[b == cnt[cnt > 1].index[0]]

b    95
d    95
Name: 수학, dtype: int64

In [80]:
import pandas as pd

arr =[
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

idx = ['h1','h2','h3']
col = ['c1','c2','c3']
df = pd.DataFrame(arr,idx,col)
df

    c1  c2  c3
h1   1   2   3
h2   4   5   6
h3   7   8   9

In [84]:
df.add(df)

    c1  c2  c3
h1   2   4   6
h2   8  10  12
h3  14  16  18

In [ ]:
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
arr.append([10,11,12])
# arr[3] = [10,11,12]

In [85]:
df.drop("행4",axis=0,inplace=True)
df

KeyError: "['행4'] not found in axis"